package Homework6;

public class Task4 {
    public static void main(String[] args) {
String strr = "Crazy Catment";

String replaceletters = strr.replace(" ", "/");
        System.out.println(replaceletters);
}
    }

/*
Задание 4
        Имеется строка заменить все символы пробела на сивол “/”.*/
